{"id":14,"date":"2021-05-27T21:00:48","date_gmt":"2021-05-27T21:00:48","guid":{"rendered":"http:\/\/redgranite.co.zw\/?page_id=14"},"modified":"2021-06-29T13:18:19","modified_gmt":"2021-06-29T11:18:19","slug":"about-us","status":"publish","type":"page","link":"http:\/\/potetransport.github.io\/about-us\/","title":{"rendered":"About Us"},"content":{"rendered":"\n<h2>About Us<\/h2>\n\n\n<div class='w3eden'><!-- WPDM Link Template: Default Template -->\n\n\n<div class=\"link-template-default card mb-2\">\n    <div class=\"card-body\">\n        <div class=\"media stack-xs\">\n            <div class=\"media-body\">\n                <div class=\"media\">\n                    <div class=\"mr-3 img-48\"><img class=\"wpdm_icon\" alt=\"Icon\"   src=\"http:\/\/redgranite.co.zw\/wp-content\/plugins\/download-manager\/assets\/file-type-icons\/pdf.svg\" \/><\/div>\n                    <div class=\"media-body\">\n                        <h3 class=\"package-title\"><a href='http:\/\/potetransport.github.io\/download\/pote-holdings-profile\/'>Pote Transport Profile<\/a><\/h3>\n                        <div class=\"text-muted text-small\"><i class=\"fas fa-copy\"><\/i> 1 file(s) <i class=\"fas fa-hdd ml-3\"><\/i> 3.82 MB<\/div>\n                    <\/div>\n                <\/div>\n            <\/div>\n            <div class=\"ml-3 wpdmdl-btn\">\n                <a class='wpdm-download-link download-on-click btn btn-danger btn-lg' rel='nofollow' href='#' data-downloadurl=\"http:\/\/potetransport.github.io\/download\/pote-holdings-profile\/?wpdmdl=127&refresh=60db03f9292261624966137\">Download<\/a>\n            <\/div>\n        <\/div>\n    <\/div>\n<\/div>\n\n\n<\/div>\n\n\n\n<p class=\"has-drop-cap\">Our transport division comprises <strong>102 <\/strong>trucks available for hire. In order to remain flexible and successfully provide personalized services to our clients, we operate a fleet of side tippers, flatbed, and drop sides. The entire fleet is fully insured with goods in transit insurance covering the whole of Southern Africa. All our vehicles have a fully installed tracking system that is closely monitored 24 hours a day and works well throughout Southern Africa.<\/p>\n\n\n\n<p>The company provides road transport and logistics solutions within the country and between Zimbabwe and neighbouring Southern African countries such as South Africa, Zambia, Botswana and Namibia<\/p>\n\n\n\n<p>We have experienced road transport operators and mechanics who specially deliver a high quality, skilled service on our vehicles and we have no breakdown that keeps a vehicle stationary for a long time no matter the site.<\/p>\n\n\n\n<p>As a privately owned company with humble beginnings, the company has grown to become the road cargo transport and logistics solution of choice for companies in every sector of the industry especially those requiring transportation of necessary goods within a specified time frame.<\/p>\n\n\n\n<p>Our aim is to provide affordable, one stop transport and logistical services for all types of road transportation within Southern Africa. We strive to be the most successful transport and logistics company in the regional industry and to continually improve our market share by offering competitive rates in conjunction with superior service, optimal use of available resources, innovation and cost saving initiatives.<\/p>\n\n\n\n<p>The company aims to maintain and grow on its high profile in the market by:<\/p>\n\n\n\n<ul><li>Maintaining service excellence<\/li><li>Providing superior transport solutions according to each customer’s needs<\/li><li>Treating staff and customers with respect and honesty<\/li><li>Appointing high quality staff (vetted by extensive background checks)<\/li><li>Developing new and innovative ways to safely and cost effectively transport cargo<\/li><li>Offering customers a dedicated, personalised service<\/li><\/ul>\n\n\n\n<p>Pote Transport is comprehensively equipped with a wide range of well maintained transportation equipment and vehicles.<\/p>\n\n\n\n<p>To ensure a high quality, efficient and prompt service, the average age of our fleet is maintained at three years and new vehicles are purchased every year.<\/p>\n\n\n\n<p>Our vehicles are regularly serviced and strictly maintained to set manufacturer maintenance schedules. A high level of driver training maintains the excellent standard of our fleet.Driver performance is continually monitored using satellite surveillance and management devices in all vehicles.<\/p>\n\n\n\n<p>Our company is known for the outstanding relationship it has with all relevant staff and managers, and its ability to get all goods on site without damage and on time.<\/p>\n\n\n\n<p>Pote Transport is highly respected by its clients, because the company is organised and thorough in its planning and paperwork.Details of each trip are recorded and assessed to ensure the safety of the drivers, vehicles and goods transported<\/p>\n\n\n\n<p>Delivery times on all routes are strictly monitored<\/p>\n\n\n\n<p>Administrative control is exceptionally important to us, and functions at the highest level possible. This is to ensure quick and efficient invoicing of clients, which means that customs documentation is rapidly returned to clients for tax and other purposes.<\/p>\n\n\n\n<p>We currently have a contract with Mimosa Mining Company to transport ore concentrate to South Africa and other contracts with WFP, GMB and National Foods. We also have another contract with Food Reserve Agencies of Zambia transporting grain from Zambia to Gweru and are also offering transport services to several other businesses and organisations on hiring basis.<\/p>\n\n\n\n<p>The success of the rest of our departments is heavily dependent on our transport and logistics solutions for the provision of the products that <\/p>\n\n\n\n<p>keep the relevant businesses running.<\/p>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\nhttps:\/\/www.youtube.com\/watch?v=HLpvycNWuNQ\n<\/div><\/figure>\n","protected":false},"excerpt":{"rendered":"<p>About Us Our transport division comprises 102 trucks available for hire. In order to remain flexible and successfully provide personalized services to our clients, we operate a fleet of side tippers, flatbed, and drop sides. The entire fleet is fully insured with goods in transit insurance covering the whole of Southern Africa. All our vehicles [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"templates\/template-full-width.php","meta":[],"featured_image_urls":{"full":"","thumbnail":"","medium":"","medium_large":"","large":"","1536x1536":"","2048x2048":"","post-thumbnail":"","twentytwenty-fullscreen":""},"post_excerpt_stackable":"<p>About Us Pote Transport Profile 1 file(s) 3.82 MB Download Our transport division comprises 102 trucks available for hire. In order to remain flexible and successfully provide personalized services to our clients, we operate a fleet of side tippers, flatbed, and drop sides. The entire fleet is fully insured with goods in transit insurance covering the whole of Southern Africa. All our vehicles have a fully installed tracking system that is closely monitored 24 hours a day and works well throughout Southern Africa. The company provides road transport and logistics solutions within the country and between Zimbabwe and neighbouring Southern&hellip;<\/p>\n","category_list":"","author_info":{"name":"admin","url":"http:\/\/potetransport.github.io\/author\/admin\/"},"comments_num":"0 comments","_links":{"self":[{"href":"http:\/\/potetransport.github.io\/wp-json\/wp\/v2\/pages\/14"}],"collection":[{"href":"http:\/\/potetransport.github.io\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"http:\/\/potetransport.github.io\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"http:\/\/potetransport.github.io\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/potetransport.github.io\/wp-json\/wp\/v2\/comments?post=14"}],"version-history":[{"count":8,"href":"http:\/\/potetransport.github.io\/wp-json\/wp\/v2\/pages\/14\/revisions"}],"predecessor-version":[{"id":509,"href":"http:\/\/potetransport.github.io\/wp-json\/wp\/v2\/pages\/14\/revisions\/509"}],"wp:attachment":[{"href":"http:\/\/potetransport.github.io\/wp-json\/wp\/v2\/media?parent=14"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}